---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyDistance.Value
source: html/e7e430bf-13a7-474c-e847-b8634fdee996.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDistance.Value Property

Value of the property.

## Syntax (C#)
```csharp
public double Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyDistance property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.